## Plan Result (environments/production)
- [CI link](https://github.com/jinugasachio/advanced-ecs-on-fargate/actions/runs/1676267309)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_vpc.network


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_vpc.network will be created
  + resource "aws_vpc" "network" {
      + arn                            = (known after apply)
      + cidr_block                     = "10.0.0.0/16"
      + default_network_acl_id         = (known after apply)
      + default_route_table_id         = (known after apply)
      + default_security_group_id      = (known after apply)
      + dhcp_options_id                = (known after apply)
      + enable_classiclink             = (known after apply)
      + enable_classiclink_dns_support = (known after apply)
      + enable_dns_hostnames           = (known after apply)
      + enable_dns_support             = true
      + id                             = (known after apply)
      + instance_tenancy               = "default"
      + ipv6_association_id            = (known after apply)
      + ipv6_cidr_block                = (known after apply)
      + main_route_table_id            = (known after apply)
      + owner_id                       = (known after apply)
      + tags_all                       = {
          + "Environments" = "production"
          + "Terraform"    = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"execute-terraform-plan","PRNumber":97,"Program":"tfcmt","SHA1":"61e341aa8b255a4b50313dfff3b3025156228ec6","Target":"environments/production","Vars":{},"WorkflowName":"Terraform plan"} -->